---
kind: type
id: T:Autodesk.Revit.DB.FaceIntersectionFaceResult
source: html/dafc9c77-f17a-1ad8-0bcb-422b4309ee43.htm
---
# Autodesk.Revit.DB.FaceIntersectionFaceResult

An enumerated type listing the possible results of a face-face intersection calculation.

## Syntax (C#)
```csharp
public enum FaceIntersectionFaceResult
```